--
-- data for table `realtor`
--

INSERT INTO `realtor` VALUES 
  (0001,'Агафонова Полина Ильинична','aojv@mail.ru',78776641047,'wena_love','17941d92e089f4cec1784997766bc08a204f3bce','2016-09-02',NULL),
  (0002,'Андрианова Татьяна Тимуровна','kggfpxw@yandex.ru',78779539403,'irrandarcoa1999','9ebe5c4a057a37ff7b496339a70ce21b2e63f81d','2019-05-30',NULL),
  (0003,'Беляева Мирослава Кирилловна','oxxv@yandex.ru',77697387871,'ressaya_wi77','618710a96df9e25a85311f024f4f4fd09b5c9e86','2016-07-14',NULL),
  (0004,'Горбунова Варвара Васильевна','f9jxjd14@gmail.com',78651667118,'mps_tepha','ed4f9e516d14d437718f1de0689cebc66dd55afb','2016-03-22',NULL),
  (0005,'Григорьева Полина Кирилловна','p24a@mail.ru',77986211913,'wedvarmani','4c9df4f64620cb9308037124c2fa332f068ddc89','2016-03-29',NULL),
  (0006,'Гущина Милена Егоровна','ahbg@yandex.ru',77830480839,'useliryza','2e97aa94077eae67df80fd654a7292f332277b6c','2020-10-23',NULL),
  (0007,'Данилов Павел Николаевич','xl9bc5@gmail.com',77955286880,'x_avier20','30715435e45cbe461320899b0de835733e2c7ee9','2016-02-24',NULL),
  (0008,'Данилова София Сергеевна','q4aptu@mail.ru',78908667520,'beramamock1','0a791e403d99e85682bed70b9fdd839dbe7360be','2016-12-23',NULL),
  (0009,'Зуев Руслан Кириллович','n4zc9kz@yandex.ru',77702858214,'scivaluci','67720fa9cc56bcc1dfa5bc9b88018ce18f5234c9','2017-08-17',NULL),
  (0010,'Николаев Дмитрий Максимович','copaa6@gmail.com',77840565279,'mahild','c7425d6d10d5817026f30833c21c169801b9c0ff','2019-05-31',NULL),
  (0011,'Родионов Даниил Романович','myrfqpb@mail.ru',78206306518,'si43mor','86e68dc753cdda87ccaf6bfa960f58b3ead9a580','2016-11-25',NULL),
  (0012,'Романов Роман Всеволодович','kc29hc0e@yandex.ru',78320150506,'curpulse123','c393b51cb639b22f667611ee20770bc36aa2aecb','2017-09-01',NULL),
  (0013,'Савельев Илья Глебович','pvvxl@gmail.com',77907798926,'1prosluch','5495025fbe54bb66e84e3215845dee890b08daa9','2018-08-02',NULL),
  (0014,'Смирнов Николай Матвеевич','5ybwi@mail.ru',78674117887,'putin_kgb','6da79725efedfe8a33c619221ec88bd2fdf054b2','2017-04-27',NULL),
  (0015,'Сорокин Никита Иванович','44dc1ffm@yandex.ru',77607786517,'azhwekk_grand','ced60c1c5b4d646166e6968f6b18b10e607dc32a','2017-04-03',NULL),
  (0016,'Трофимова Елизавета Саввична','namsavv@mail.ru',77411247701,'arstarotten','4c6c006f7bf237a3499328291c76c1869ed2c02c','2017-04-10',NULL);
--
-- data for table `district`
--

INSERT INTO `district` VALUES 
  (427,'Арбат'),(428,'Басманный'),(429,'Замоскворечье'),(430,'Красносельский'),
  (431,'Мещанский'),(432,'Пресненский'),(433,'Таганский'),(434,'Тверской'),
  (435,'Хамовники'),(436,'Якиманка'),(437,'Аэропорт'),(438,'Беговой'),(439,'Бескудниковский'),
  (440,'Войковский'),(441,'Головинский'),(442,'Восточное Дегунино'),(443,'Западное Дегунино'),
  (444,'Дмитровский'),(445,'Коптево'),(446,'Левобережья'),(447,'Молжаниновский'),(448,'Савёловский'),
  (449,'Сокол'),(450,'Тимирязевский'),(451,'Ховрино'),(452,'Хорошёвский'),(453,'Алексеевский'),
  (454,'Алтуфьевский'),(455,'Бабушкинский'),(456,'Бибирево'),(457,'Бутырский'),(458,'Лианозово'),
  (459,'Лосиноостровский'),(460,'Марфино'),(461,'Марьина роща'),(462,'Медведково'),
  (463,'Останкинский'),(464,'Отрадное'),(465,'Ростокино'),(466,'Свиблово'),(467,'Северный'),
  (468,'Ярославский'),(469,'Богородское'),(470,'Вешняки'),(471,'Восточный'),(472,'Гольяново'),
  (473,'Ивановское'),(474,'Измайлово'),(475,'Косино-Ухтомкий'),(476,'Метрогородок'),(477,'Новогиреево'),
  (478,'Новокосино'),(479,'Перово'),(480,'Преображенское'),(481,'Соколиная гора'),(482,'Сокольники'),
  (483,'Выхино-Жулебино'),(484,'Капотня'),(485,'Кузьминки'),(486,'Лефортово'),(487,'Люблино'),
  (488,'Марьино'),(489,'Некрасовка'),(490,'Нижегородский'),(491,'Печатники'),(492,'Рязанский'),
  (493,'Текстильщики'),(494,'Южнопортовый'),(495,'Вотсочное Бирюлёво'),(496,'Западное Бирюлёво'),
  (497,'Братеево'),(498,'Даниловский'),(499,'Донской'),(500,'Зябликово'),(501,'Московречье-Сабурово'),
  (502,'Нагатино-Садовники'),(503,'Нагатинский'),(504,'Нагорный'),(505,'Северное Орехово-Борисово'),
  (506,'Южное Орехово-Борисово'),(507,'Царицыно'),(508,'Северное Чертаново'),(509,'Центральное Чертаново'),
  (510,'Южное Чертаново'),(549,'Академический'),(550,'Северное Бутово'),(551,'Южное Бутово'),
  (552,'Гагаринский'),(553,'Зюзино'),(554,'Коньково'),(555,'Котловка'),(556,'Ломоносовский'),
  (557,'Обручевский'),(558,'Тёплый Стан'),(559,'Черёмушки'),(560,'Ясенево'),(574,'Внуково'),
  (575,'Дорогомилово'),(576,'Крылатское'),(577,'Кунцево'),(578,'Можайский'),(579,'Ново-Переделкино'),
  (580,'Очаково-Матвеевское'),(581,'Проспект Вернандского'),(582,'Раменки'),(583,'Солнцево'),
  (584,'Тропарёво-Никулино'),(585,'Филёвский парк'),(586,'Фили-Давыдково'),(587,'Куркино'),
  (588,'Митино'),(589,'Покровское-Стрешнево'),(590,'Строгино'),(591,'Северное Тушино'),
  (592,'Южное Тушино'),(593,'Хорошёво-Мневники'),(594,'Щукино'),(595,'Матушкино'),(596,'Савёлки'),
  (597,'Старое Крюково'),(598,'Силино'),(599,'Крюково'),(600,'Вороновское'),(601,'Киевский'),
  (602,'Клёновское'),(603,'Краснопахорское'),(604,'Михайлово-Ярцеское'),(605,'Новофёдовское'),
  (606,'Первомайское'),(607,'Роговское'),(608,'Троицк'),(609,'Щаповское'),(610,'Внуковское'),
  (611,'Воскресенское'),(612,'Десёновское'),(613,'Кокошино'),(614,'Марушинское'),(615,'Московский'),
  (616,'Рязановское'),(617,'Сосенское'),(618,'Филимоновское'),(619,'Щербинка');

--
-- data for table `property_type`
--

INSERT INTO `property_type` VALUES 
  (2001,'Квартира',0),(2002,'Комната',0),(2003,'Доля',0),(2004,'Дом',0),
  (2005,'Часть дома',0),(2006,'Таунхаус',0),(2007,'Участок',0),(2011,'Офис',1),
  (2012,'Торговая площадь',1),(2013,'Склад',1),(2014,'Свободного назначения',1),
  (2015,'Здание',1),(2016,'Гараж',1),(2017,'Производство',1);
  
--
-- data for table `transaction_type`
--

INSERT INTO `transaction_type` VALUES (5001,'Обмен'),(5002,'Купля-продажа'),(5003,'Аренда');

--
-- data for table `contract_type`
--

INSERT INTO `contract_type` VALUES (1001,'Поручение'),(1002,'Комиссия'),(1003,'Агентский');

--
-- data for table `property`
--

INSERT INTO `property` VALUES 
  (0001,2006,0604,5001,0013,'109029, Москва, ул.Воловья, 87, кв.92',27,6,'143',5,1,'Квартира в кирпичном доме, который удачно расположен - рядом озеро, в прошлом году проведено благоустройство прилегающей территории - набережной и парковой зоны. ',11137105.00,1),
  (0002,2012,0599,5003,0004,'129090, Москва, ул.Мещанская, 77, кв.29',6,6,'240.5',1,1,'В квартире выполнен ремон, полы и стены выровнены,натяжные потолки,сантехника и проводка менялась.',1004905.00,0),
  (0003,2012,0441,5002,0017,'129345, Москва, ул.Оборонная, 40, кв.88',1,3,'140.3',1,1,'Продается теплая просторная 2-комнатная квартира на высоком первом этаже',4521033.00,0),
  (0004,2001,0558,5002,0012,'109202, Москва, ул.1-я Карачаровская, 69, кв.52',26,4,'239.8',2,2,'Встроенная кухня и посудомойка остаются,пол ламинат.',11802236.00,0),
  (0005,2014,0578,5003,0020,'109472, Москва, ул.Садоводства, 91, кв.21',9,7,'200.5',3,2,'Квартира светлая, окна выходят на запад. Удобная планировка квартиры - кухня соединена с комнатой в единое пространство.',13198169.00,1),
  (0006,2013,0466,5002,0013,'121374, Москва, ул.Сафоновская, 66, кв.29',21,6,'56.9',5,1,NULL,14860427.00,0),
  (0007,2006,0496,5001,0018,'125239, Москва, ул.Коптевская, 20, кв.30',21,5,'159.2',5,2,NULL,17529565.00,0),
  (0008,2002,0477,5003,0015,'107553, Москва, ул.Штатная Горка, 50, кв.60',15,6,'52.8',3,1,'В стоимость квартиры входит кухня с техникой (газовая варочная панель, вытяжка), шкаф в коридоре. ',3094885.00,1),
  (0009,2011,0449,5002,0003,'109193, Москва, ул.Петра Романова, 5, кв.69',11,6,'57.7',5,1,'',10292995.00,0),
  (0010,2017,0453,5002,0002,'125315, Москва, ул.2-я Усиевича, 56, кв.52',17,2,'80.7',1,2,NULL,3116343.00,0),
  (0011,2014,0473,5002,0004,'109428, Москва, ул.2-я Институтская, 76, кв.30',2,4,'102.9',3,2,'Красивый, зеленый район',17478392.00,1),
  (0012,2005,0603,5002,0014,'129327, Москва, ул.Чичерина, 28, кв.57',25,5,'138.5',4,1,'Ипотека возможна.',4784976.00,0),
  (0013,2007,0500,5003,0007,'119619, Москва, ул.4-я Новые Сады, 96, кв.37',27,3,'165.6',1,1,'Продается уютная, 3 комнатная квартира в спальном районе. ',10783256.00,1),
  (0014,2006,0455,5003,0002,'109382, Москва, ул.Егорьевская, 43, кв.97',20,3,'42.4',2,2,'До метро Нижегородская на электричке 20 минут.',18133517.00,0),
  (0015,2017,0552,5001,0018,'119361, Москва, ул.Марии Поливановой, 71, кв.40',2,3,'78.4',1,2,'Перепланировка отсутствует.',17280328.00,0),
  (0016,2014,0505,5003,0015,'119634, Москва, ул.Лукинская, 73, кв.26',10,2,'203.1',1,1,'Поблизости работают супермаркеты, фитнес-клуб с бассейном, школы и детские сады. ',19254308.00,1),
  (0017,2012,0450,5003,0003,'103031, Москва, ул.Пушечная, 6, кв.72',23,2,'174.9',1,1,' В пешей доступности фитнес центр, бассейн, стадион, гимназия, детские сады, магазины, вся необходимая для жизни инфраструктура.',4935805.00,1),
  (0018,2005,0469,5001,0018,'111024, Москва, ул.1-я Энтузиастов, 100, кв.24',25,4,'126.8',1,2,' Рядом с домом есть многоуровневый охраняемый паркинг.',5661511.00,0),
  (0019,2017,0605,5002,0015,'109202, Москва, ул.1-я Карачаровская, 78, кв.61',15,3,'149.5',2,1,NULL,2025144.00,0),
  (0020,2003,0593,5002,0014,'117049, Москва, ул.Крымский Вал, 58, кв.66',9,3,'152.9',2,2,'До ж/д станции Кучино пешком 20 минут.',10714055.00,0);

--
-- data for table `client_type`
--

INSERT INTO `client_type` VALUES (0001,'Клиент'),(0002,'Агент');

--
-- data for table `client`
--

INSERT INTO `client` VALUES 
  (0001,0001,'Виктор','Абрамов','Тимурович','4516 710573','omminnimmufe-7698@pmail.com',78474882794,793145243468175158,5558066691,654654552),
  (0002,0002,'Иван','Алексеев','Львович','4628 273829','ypawiffizu-3658@mail.com',77870332987,901392469384679220,9680605452,205188375),
  (0003,0001,'Ева','Владимирова','Николаевна',NULL,'xariqajena-5833@yandex.com',78048258215,101388992461279718,3628154140,604498374),
  (0004,0001,'София','Власова','Тимофеевна',NULL,'newerrido-8379@mail.ru',77932764676,345682016201647271,8421477027,468083877),
  (0005,0002,'Василий','Воробьёв','Иванович','2763 237382','paqogawe-0138@mail.ru',78291353378,401840069463861812,4808802619,751679898),
  (0006,0001,'Гусева','Виктория','Ивановна',NULL,'ejefygix_8580@gmail.com',78272713908,896957358221612437,1218116162,337444118),
  (0007,0001,'Демьянова','Кира','Сергеевна','4543 729497','ojoditatt1048@gmail.ru',77828981928,580631533613813954,3853924591,660055575),
  (0008,0002,'Егорова','Анна','Михайловна','9384 374625','iffupinozu1339@yopmail.com',77864251598,444219243239760185,6112567812,794879298),
  (0009,0001,'Дмитрий','Кочергин','Елисеевич','6563 376227','AlIxkx4LDqus@gmail.com',78681241628,478239705827499734,9715120120,430146759),
  (0010,0001,'Антон','Большаков','Дмитриевич',NULL,'MQT5.Xv@mail.ru',77558722341,397296669500888998,9666780559,297336680),
  (0011,0001,'Давид','Давыдов','Давидович',NULL,'6USj_cCpxprCzV@gmail.com',78047978631,272995207761113385,8387156911,252544009),
  (0012,0002,'Юлия','Зотова','Владимировна',NULL,'w9103@mail.ru',78033227548,364678175278293306,1116614900,336126755),
  (0013,0001,'Ульяна','Королёва','Константиновна','3445 767676','p77k9agkfSlhK4@yandex.ru',77715490892,911833506312103690,2815442433,221816433),
  (0014,0001,'Анна','Калинина','Максимовна',NULL,'3w7UDB1rW3sAPS@mail.ru',78024111508,456555782100428099,8942082956,873512526),
  (0015,0001,'Далесх','Инубас',NULL,NULL,'2zVt.B.nOI6mhf@gmail.com',79795585879,160536175518944537,1968370111,247176534),
  (0016,0001,'Александра','Пономарёва','Петровна','4643 756465','puT6XlaAv5_9@gmail.com',77854608238,336150209464093867,5298990957,987750887),
  (0017,0002,'Елизавета','Поликарпова','Романовна',NULL,'wS6F.@yandex.ru',78486566991,873947599844608471,7848605161,620489227),
  (0018,0002,'Кирилл','Рыбаков','Маркович','6543 767445','nmxWEuKvZYf@mail.ru',78257005070,109981234545268568,7918432080,598847619),
  (0019,0002,'Дарья','Тарасова','Данииловна',NULL,'isWPHX@gmail.com',78675029781,608134682426675411,7740945089,825812671),
  (0020,0001,'Тихон','Соловьев','Ярославович',NULL,'78t0DI81Rex9I0Z@gmail.com',78772131582,927011491448235967,8500840046,633082788);

--
-- data for table `request`
--

INSERT INTO `request` VALUES 
  (0001,0011,0007,0007,5003,NULL,15747269.00,'2020-09-16 05:46:13','1'),
  (0002,0009,0003,0010,5003,NULL,12748504.00,'2020-04-07 17:59:38','1'),
  (0003,NULL,0014,0005,5002,'Нужна пустая квартира с белыми стенами и чтобы соседей ни сверху ни снизу',7512211.00,'2020-12-10 12:24:19','1'),
  (0004,0015,0005,0012,5001,NULL,19145358.00,'2020-11-20 07:33:37','1'),
  (0005,0008,0015,0015,5001,'Обменяю свою квартиру на что-нибудь получше',5128511.00,'2020-08-25 08:06:30','1'),
  (0006,0011,0018,0005,5003,NULL,11493878.00,'2020-04-02 03:14:11','1'),
  (0007,0008,0015,0001,5002,NULL,14519685.00,'2020-12-29 19:16:30','1'),
  (0008,0015,0013,0003,5001,NULL,13826854.00,'2020-05-16 04:29:52','1'),
  (0009,0019,0011,0004,5002,NULL,9754888.00,'2020-06-13 10:44:33','1'),
  (0010,0014,0016,0003,5002,NULL,14293496.00,'2020-02-03 06:11:49','1'),
  (0011,NULL,0009,0004,5003,'Сниму шикарные апартаменты',245337.00,'2020-06-19 23:58:04','1'),
  (0012,0013,0020,0008,5002,'Продам трёшку в гнилой хрущевке',1322850.00,'2020-08-31 19:34:02','1'),
  (0013,NULL,0008,0003,5002,'Куплю большую квартиру-студию',6307920.00,'2020-11-21 14:06:09','1'),
  (0014,0005,0009,0014,5002,'Продам отличную квартиру',1353280.00,'2020-07-15 05:51:24','1'),
  (0015,0004,0019,0001,5003,NULL,7959750.00,'2020-06-02 04:36:18','1'),
  (0016,0011,0005,0003,5002,NULL,4460998.00,'2020-01-24 22:03:01','1'),
  (0017,0015,0008,0013,5002,NULL,7783283.00,'2020-10-27 10:58:29','1'),
  (0018,0004,0019,0001,5002,NULL,6402289.00,'2020-08-21 11:19:17','1'),
  (0019,0007,0006,0014,5003,NULL,7463933.00,'2020-03-24 13:38:57','1'),
  (0020,NULL,0007,0016,5003,'Сниму небольшое помещение в центре города',1985653.00,'2020-06-26 18:57:08','1'),
  (0021,0014,0003,0001,5003,NULL,18717733.00,'2020-12-08 21:26:19','1'),
  (0022,0012,0019,0009,5003,NULL,13338331.00,'2021-01-20 06:49:34','1'),
  (0023,0017,0012,0010,5001,NULL,6730485.00,'2020-09-14 21:11:39','1'),
  (0024,0016,0016,0013,5002,NULL,15468420.00,'2020-02-05 14:36:30','1'),
  (0025,0003,0011,0015,5001,'Обменяю халупу на дворец',7973212.00,'2020-12-31 05:05:37','1'),
  (0026,0010,0020,0016,5003,'0',3023735.00,'2020-09-26 20:39:57','1'),
  (0027,0005,0017,0012,5002,NULL,15490341.00,'2020-04-13 01:37:28','1'),
  (0028,0003,0015,0006,5003,NULL,18884271.00,'2020-06-12 21:05:36','1');

--
-- data for table `show_property_meet`
-- для заполнения данной таблицы существует процедура schedule_show(request_id, property_id)


--
-- data for table `contract`
-- а для этой - add_contract()
