--
`realtor`
--

INSERT INTO `realtor` VALUES 
  (0001,'Агафонова Полина Ильинична','aojv@mail.ru',78776641047,'wena_love','17941d92e089f4cec1784997766bc08a204f3bce','2016-09-02',NULL),
  (0002,'Андрианова Татьяна Тимуровна','kggfpxw@yandex.ru',78779539403,'irrandarcoa1999','9ebe5c4a057a37ff7b496339a70ce21b2e63f81d','2019-05-30',NULL),
  (0003,'Беляева Мирослава Кирилловна','oxxv@yandex.ru',77697387871,'ressaya_wi77','618710a96df9e25a85311f024f4f4fd09b5c9e86','2016-07-14',NULL),
  (0004,'Горбунова Варвара Васильевна','f9jxjd14@gmail.com',78651667118,'mps_tepha','ed4f9e516d14d437718f1de0689cebc66dd55afb','2016-03-22',NULL),
  (0005,'Григорьева Полина Кирилловна','p24a@mail.ru',77986211913,'wedvarmani','4c9df4f64620cb9308037124c2fa332f068ddc89','2016-03-29',NULL),
  (0006,'Гущина Милена Егоровна','ahbg@yandex.ru',77830480839,'useliryza','2e97aa94077eae67df80fd654a7292f332277b6c','2020-10-23',NULL),
  (0007,'Данилов Павел Николаевич','xl9bc5@gmail.com',77955286880,'x_avier20','30715435e45cbe461320899b0de835733e2c7ee9','2016-02-24',NULL),
  (0008,'Данилова София Сергеевна','q4aptu@mail.ru',78908667520,'beramamock1','0a791e403d99e85682bed70b9fdd839dbe7360be','2016-12-23',NULL),
  (0009,'Зуев Руслан Кириллович','n4zc9kz@yandex.ru',77702858214,'scivaluci','67720fa9cc56bcc1dfa5bc9b88018ce18f5234c9','2017-08-17',NULL),
  (0010,'Николаев Дмитрий Максимович','copaa6@gmail.com',77840565279,'mahild','c7425d6d10d5817026f30833c21c169801b9c0ff','2019-05-31',NULL),
  (0011,'Родионов Даниил Романович','myrfqpb@mail.ru',78206306518,'si43mor','86e68dc753cdda87ccaf6bfa960f58b3ead9a580','2016-11-25',NULL),
  (0012,'Романов Роман Всеволодович','kc29hc0e@yandex.ru',78320150506,'curpulse123','c393b51cb639b22f667611ee20770bc36aa2aecb','2017-09-01',NULL),
  (0013,'Савельев Илья Глебович','pvvxl@gmail.com',77907798926,'1prosluch','5495025fbe54bb66e84e3215845dee890b08daa9','2018-08-02',NULL),
  (0014,'Смирнов Николай Матвеевич','5ybwi@mail.ru',78674117887,'putin_kgb','6da79725efedfe8a33c619221ec88bd2fdf054b2','2017-04-27',NULL),
  (0015,'Сорокин Никита Иванович','44dc1ffm@yandex.ru',77607786517,'azhwekk_grand','ced60c1c5b4d646166e6968f6b18b10e607dc32a','2017-04-03',NULL),
  (0016,'Трофимова Елизавета Саввична','namsavv@mail.ru',77411247701,'arstarotten','4c6c006f7bf237a3499328291c76c1869ed2c02c','2017-04-10',NULL);

--
`district`
--

INSERT INTO `district` VALUES 
  (427,'ЦАО','Арбат'),(428,'ЦАО','Басманный'),(429,'ЦАО','Замоскворечье'),(430,'ЦАО','Красносельский'),
  (431,'ЦАО','Мещанский'),(432,'ЦАО','Пресненский'),(433,'ЦАО','Таганский'),(434,'ЦАО','Тверской'),
  (435,'ЦАО','Хамовники'),(436,'ЦАО','Якиманка'),(437,'САО','Аэропорт'),(438,'САО','Беговой'),(439,'САО','Бескудниковский'),
  (440,'САО','Войковский'),(441,'САО','Головинский'),(442,'САО','Восточное Дегунино'),(443,'САО','Западное Дегунино'),
  (444,'САО','Дмитровский'),(445,'САО','Коптево'),(446,'САО','Левобережья'),(447,'САО','Молжаниновский'),(448,'САО','Савёловский'),
  (449,'САО','Сокол'),(450,'САО','Тимирязевский'),(451,'САО','Ховрино'),(452,'САО','Хорошёвский'),(453,'СВАО','Алексеевский'),
  (454,'СВАО','Алтуфьевский'),(455,'СВАО','Бабушкинский'),(456,'СВАО','Бибирево'),(457,'СВАО','Бутырский'),(458,'СВАО','Лианозово'),
  (459,'СВАО','Лосиноостровский'),(460,'СВАО','Марфино'),(461,'СВАО','Марьина роща'),(462,'СВАО','Медведково'),(463,'СВАО','Останкинский'),
  (464,'СВАО','Отрадное'),(465,'СВАО','Ростокино'),(466,'СВАО','Свиблово'),(467,'СВАО','Северный'),(468,'СВАО','Ярославский'),
  (469,'ВАО','Богородское'),(470,'ВАО','Вешняки'),(471,'ВАО','Восточный'),(472,'ВАО','Гольяново'),(473,'ВАО','Ивановское'),
  (474,'ВАО','Измайлово'),(475,'ВАО','Косино-Ухтомкий'),(476,'ВАО','Метрогородок'),(477,'ВАО','Новогиреево'),(478,'ВАО','Новокосино'),
  (479,'ВАО','Перово'),(480,'ВАО','Преображенское'),(481,'ВАО','Соколиная гора'),(482,'ВАО','Сокольники'),(483,'ЮВАО','Выхино-Жулебино'),
  (484,'ЮВАО','Капотня'),(485,'ЮВАО','Кузьминки'),(486,'ЮВАО','Лефортово'),(487,'ЮВАО','Люблино'),(488,'ЮВАО','Марьино'),(489,'ЮВАО','Некрасовка'),
  (490,'ЮВАО','Нижегородский'),(491,'ЮВАО','Печатники'),(492,'ЮВАО','Рязанский'),(493,'ЮВАО','Текстильщики'),(494,'ЮВАО','Южнопортовый'),
  (495,'ЮАО','Вотсочное Бирюлёво'),(496,'ЮАО','Западное Бирюлёво'),(497,'ЮАО','Братеево'),(498,'ЮАО','Даниловский'),(499,'ЮАО','Донской'),
  (500,'ЮАО','Зябликово'),(501,'ЮАО','Московречье-Сабурово'),(502,'ЮАО','Нагатино-Садовники'),(503,'ЮАО','Нагатинский'),(504,'ЮАО','Нагорный'),
  (505,'ЮАО','Северное Орехово-Борисово'),(506,'ЮАО','Южное Орехово-Борисово'),(507,'ЮАО','Царицыно'),(508,'ЮАО','Северное Чертаново'),
  (509,'ЮАО','Центральное Чертаново'),(510,'ЮАО','Южное Чертаново'),(549,'ЮЗАО','Академический'),(550,'ЮЗАО','Северное Бутово'),
  (551,'ЮЗАО','Южное Бутово'),(552,'ЮЗАО','Гагаринский'),(553,'ЮЗАО','Зюзино'),(554,'ЮЗАО','Коньково'),(555,'ЮЗАО','Котловка'),
  (556,'ЮЗАО','Ломоносовский'),(557,'ЮЗАО','Обручевский'),(558,'ЮЗАО','Тёплый Стан'),(559,'ЮЗАО','Черёмушки'),(560,'ЮЗАО','Ясенево'),
  (574,'ЗАО','Внуково'),(575,'ЗАО','Дорогомилово'),(576,'ЗАО','Крылатское'),(577,'ЗАО','Кунцево'),(578,'ЗАО','Можайский'),(579,'ЗАО','Ново-Переделкино'),
  (580,'ЗАО','Очаково-Матвеевское'),(581,'ЗАО','Проспект Вернандского'),(582,'ЗАО','Раменки'),(583,'ЗАО','Солнцево'),(584,'ЗАО','Тропарёво-Никулино'),
  (585,'ЗАО','Филёвский парк'),(586,'ЗАО','Фили-Давыдково'),(587,'СЗАО','Куркино'),(588,'СЗАО','Митино'),(589,'СЗАО','Покровское-Стрешнево'),
  (590,'СЗАО','Строгино'),(591,'СЗАО','Северное Тушино'),(592,'СЗАО','Южное Тушино'),(593,'СЗАО','Хорошёво-Мневники'),(594,'СЗАО','Щукино'),
  (595,'ЗелАО','Матушкино'),(596,'ЗелАО','Савёлки'),(597,'ЗелАО','Старое Крюково'),(598,'ЗелАО','Силино'),(599,'ЗелАО','Крюково'),
  (600,'ТАО','Вороновское'),(601,'ТАО','Киевский'),(602,'ТАО','Клёновское'),(603,'ТАО','Краснопахорское'),(604,'ТАО','Михайлово-Ярцеское'),
  (605,'ТАО','Новофёдовское'),(606,'ТАО','Первомайское'),(607,'ТАО','Роговское'),(608,'ТАО','Троицк'),(609,'ТАО','Щаповское'),
  (610,'НАО','Внуковское'),(611,'НАО','Воскресенское'),(612,'НАО','Десёновское'),(613,'НАО','Кокошино'),(614,'НАО','Марушинское'),
  (615,'НАО','Московский'),(616,'НАО','Рязановское'),(617,'НАО','Сосенское'),(618,'НАО','Филимоновское'),(619,'НАО','Щербинка');

--
`contract_type`
--

INSERT INTO `contract_type` VALUES (1001,'Поручение'),(1002,'Комиссия'),(1003,'Агентский');

--
`client_type`
--

INSERT INTO `client_type` VALUES (0001,'Клиент'),(0002,'Агент');

--
`property_type`
--

INSERT INTO `property_type` VALUES 
  (2001,'Квартира',0), (2002,'Комната',0),
  (2003,'Доля',0),(2004,'Дом',0),
  (2005,'Часть дома',0),(2006,'Таунхаус',0),
  (2007,'Участок',0),(2011,'Офис',1),
  (2012,'Торговая площадь',1),
  (2013,'Склад',1),(2014,'Свободного назначения',1),
  (2015,'Здание',1),(2016,'Гараж',1),(2017,'Производство',1);

--
`client`
--

INSERT INTO `client` VALUES 
  (0001,0001,'Виктор','Абрамов','Тимурович','4516 710573','omminnimmufe-7698@pmail.com',78474882794,793145243468175158,5558066691,654654552),
  (0002,0002,'Иван','Алексеев','Львович','4628 273829','ypawiffizu-3658@mail.com',77870332987,901392469384679220,9680605452,205188375),
  (0003,0001,'Ева','Владимирова','Николаевна',NULL,'xariqajena-5833@yandex.com',78048258215,101388992461279718,3628154140,604498374),
  (0004,0001,'София','Власова','Тимофеевна',NULL,'newerrido-8379@mail.ru',77932764676,345682016201647271,8421477027,468083877),
  (0005,0002,'Василий','Воробьёв','Иванович','2763 237382','paqogawe-0138@mail.ru',78291353378,401840069463861812,4808802619,751679898),
  (0006,0001,'Гусева','Виктория','Ивановна',NULL,'ejefygix_8580@gmail.com',78272713908,896957358221612437,1218116162,337444118),
  (0007,0001,'Демьянова','Кира','Сергеевна','4543 729497','ojoditatt1048@gmail.ru',77828981928,580631533613813954,3853924591,660055575),
  (0008,0002,'Егорова','Анна','Михайловна','9384 374625','iffupinozu1339@yopmail.com',77864251598,444219243239760185,6112567812,794879298),
  (0009,0001,'Дмитрий','Кочергин','Елисеевич','6563 376227','AlIxkx4LDqus@gmail.com',78681241628,478239705827499734,9715120120,430146759),
  (0010,0001,'Антон','Большаков','Дмитриевич',NULL,'MQT5.Xv@mail.ru',77558722341,397296669500888998,9666780559,297336680),
  (0011,0001,'Давид','Давыдов','Давидович',NULL,'6USj_cCpxprCzV@gmail.com',78047978631,272995207761113385,8387156911,252544009),
  (0012,0002,'Юлия','Зотова','Владимировна',NULL,'w9103@mail.ru',78033227548,364678175278293306,1116614900,336126755),
  (0013,0001,'Ульяна','Королёва','Константиновна','3445 767676','p77k9agkfSlhK4@yandex.ru',77715490892,911833506312103690,2815442433,221816433),
  (0014,0001,'Анна','Калинина','Максимовна',NULL,'3w7UDB1rW3sAPS@mail.ru',78024111508,456555782100428099,8942082956,873512526),
  (0015,0001,'Давид','Кар',NULL,NULL,'2zVt.B.nOI6mhf@gmail.com',79795585879,160536175518944537,1968370111,247176534),
  (0016,0001,'Александра','Пономарёва','Петровна','4643 756465','puT6XlaAv5_9@gmail.com',77854608238,336150209464093867,5298990957,987750887),
  (0017,0002,'Елизавета','Поликарпова','Романовна',NULL,'wS6F.@yandex.ru',78486566991,873947599844608471,7848605161,620489227),
  (0018,0002,'Кирилл','Рыбаков','Маркович','6543 767445','nmxWEuKvZYf@mail.ru',78257005070,109981234545268568,7918432080,598847619),
  (0019,0002,'Дарья','Тарасова','Данииловна',NULL,'isWPHX@gmail.com',78675029781,608134682426675411,7740945089,825812671),
  (0020,0001,'Тихон','Соловьев','Ярославович',NULL,'78t0DI81Rex9I0Z@gmail.com',78772131582,927011491448235967,8500840046,633082788);

--
`property`
--

INSERT INTO `property` VALUES 
  (0001,2006,'ЮВАО',0604,5001,0013,'109029, Москва, ул.Воловья, 87, кв.92',27,6,'143',5,1,'Квартира в кирпичном доме, который удачно расположен - рядом озеро, в прошлом году проведено благоустройство прилегающей территории - набережной и парковой зоны. ',11137105.00,1),
  (0002,2012,'СВАО',0599,5003,0004,'129090, Москва, ул.Мещанская, 77, кв.29',6,6,'240.5',1,1,'В квартире выполнен ремон, полы и стены выровнены,натяжные потолки,сантехника и проводка менялась.',1004905.00,0),
  (0003,2012,'САО',0441,5002,0017,'129345, Москва, ул.Оборонная, 40, кв.88',1,3,'140.3',1,1,'Продается теплая просторная 2-комнатная квартира на высоком первом этаже',4521033.00,0),
  (0004,2001,'ВАО',0558,5002,0012,'109202, Москва, ул.1-я Карачаровская, 69, кв.52',26,4,'239.8',2,2,'Встроенная кухня и посудомойка остаются,пол ламинат.',11802236.00,0),
  (0005,2014,'ЗелАО',0578,5003,0020,'109472, Москва, ул.Садоводства, 91, кв.21',9,7,'200.5',3,2,'Квартира светлая, окна выходят на запад. Удобная планировка квартиры - кухня соединена с комнатой в единое пространство.',13198169.00,1),
  (0006,2013,'ЦАО',0466,5002,0013,'121374, Москва, ул.Сафоновская, 66, кв.29',21,6,'56.9',5,1,NULL,14860427.00,0),
  (0007,2006,'ЮВАО',0496,5001,0018,'125239, Москва, ул.Коптевская, 20, кв.30',21,5,'159.2',5,2,NULL,17529565.00,0),
  (0008,2002,'ЮВАО',0477,5003,0015,'107553, Москва, ул.Штатная Горка, 50, кв.60',15,6,'52.8',3,1,'В стоимость квартиры входит кухня с техникой (газовая варочная панель, вытяжка), шкаф в коридоре. ',3094885.00,1),
  (0009,2011,'СЗАО',0449,5002,0003,'109193, Москва, ул.Петра Романова, 5, кв.69',11,6,'57.7',5,1,'',10292995.00,0),
  (0010,2017,'ТАО',0453,5002,0002,'125315, Москва, ул.2-я Усиевича, 56, кв.52',17,2,'80.7',1,2,NULL,3116343.00,0),
  (0011,2014,'СВАО',0473,5002,0004,'109428, Москва, ул.2-я Институтская, 76, кв.30',2,4,'102.9',3,2,'Красивый, зеленый район',17478392.00,1),
  (0012,2005,'ЗелАО',0603,5002,0014,'129327, Москва, ул.Чичерина, 28, кв.57',25,5,'138.5',4,1,'Ипотека возможна.',4784976.00,0),
  (0013,2007,'ВАО',0500,5003,0007,'119619, Москва, ул.4-я Новые Сады, 96, кв.37',27,3,'165.6',1,1,'Продается уютная, 3 комнатная квартира в спальном районе. ',10783256.00,1),
  (0014,2006,'ЗАО',0455,5003,0002,'109382, Москва, ул.Егорьевская, 43, кв.97',20,3,'42.4',2,2,'До метро Нижегородская на электричке 20 минут.',18133517.00,0),
  (0015,2017,'НАО',0552,5001,0018,'119361, Москва, ул.Марии Поливановой, 71, кв.40',2,3,'78.4',1,2,'Перепланировка отсутствует.',17280328.00,0),
  (0016,2014,'ЗАО',0505,5003,0015,'119634, Москва, ул.Лукинская, 73, кв.26',10,2,'203.1',1,1,'Поблизости работают супермаркеты, фитнес-клуб с бассейном, школы и детские сады. ',19254308.00,1),
  (0017,2012,'ЦАО',0450,5003,0003,'103031, Москва, ул.Пушечная, 6, кв.72',23,2,'174.9',1,1,' В пешей доступности фитнес центр, бассейн, стадион, гимназия, детские сады, магазины, вся необходимая для жизни инфраструктура.',4935805.00,1),
  (0018,2005,'НАО',0469,5001,0018,'111024, Москва, ул.1-я Энтузиастов, 100, кв.24',25,4,'126.8',1,2,' Рядом с домом есть многоуровневый охраняемый паркинг.',5661511.00,0),
  (0019,2017,'ЦАО',0605,5002,0015,'109202, Москва, ул.1-я Карачаровская, 78, кв.61',15,3,'149.5',2,1,NULL,2025144.00,0),
  (0020,2003,'ЮВАО',0593,5002,0014,'117049, Москва, ул.Крымский Вал, 58, кв.66',9,3,'152.9',2,2,'До ж/д станции Кучино пешком 20 минут.',10714055.00,0);

--
`request`
--

INSERT INTO `request` VALUES 
  (0001,0011,0007,0007,5003,NULL,15747269.00,'2020-09-16 05:46:13','1'),
  (0002,0009,0003,0010,5003,NULL,12748504.00,'2020-04-07 17:59:38','1'),
  (0003,NULL,0014,0005,5002,'Нужна пустая квартира с белыми стенами и чтобы соседей ни сверху ни снизу',7512211.00,'2020-12-10 12:24:19','1'),
  (0004,0015,0005,0012,5001,NULL,19145358.00,'2020-11-20 07:33:37','1'),
  (0005,0008,0015,0015,5001,'Обменяю свою квартиру на что-нибудь получше',5128511.00,'2020-08-25 08:06:30','1'),
  (0006,0011,0018,0005,5003,NULL,11493878.00,'2020-04-02 03:14:11','1'),
  (0007,0008,0015,0001,5002,NULL,14519685.00,'2020-12-29 19:16:30','1'),
  (0008,0015,0013,0003,5001,NULL,13826854.00,'2020-05-16 04:29:52','1'),
  (0009,0019,0011,0004,5002,NULL,9754888.00,'2020-06-13 10:44:33','1'),
  (0010,0014,0016,0003,5002,NULL,14293496.00,'2020-02-03 06:11:49','1'),
  (0011,NULL,0009,0004,5003,'Сниму шикарные апартаменты',245337.00,'2020-06-19 23:58:04','1'),
  (0012,0013,0020,0008,5002,'Продам трёшку в гнилой хрущевке',1322850.00,'2020-08-31 19:34:02','1'),
  (0013,NULL,0008,0003,5002,'Куплю большую квартиру-студию',6307920.00,'2020-11-21 14:06:09','1'),
  (0014,0005,0009,0014,5002,'Продам отличную квартиру',1353280.00,'2020-07-15 05:51:24','1'),
  (0015,0004,0019,0001,5003,NULL,7959750.00,'2020-06-02 04:36:18','1'),
  (0016,0011,0005,0003,5002,NULL,4460998.00,'2020-01-24 22:03:01','1'),
  (0017,0015,0008,0013,5002,NULL,7783283.00,'2020-10-27 10:58:29','1'),
  (0018,0004,0019,0001,5002,NULL,6402289.00,'2020-08-21 11:19:17','1'),
  (0019,0007,0006,0014,5003,NULL,7463933.00,'2020-03-24 13:38:57','1'),
  (0020,NULL,0007,0016,5003,'Сниму небольшое помещение в центре города',1985653.00,'2020-06-26 18:57:08','1'),
  (0021,0014,0003,0001,5003,NULL,18717733.00,'2020-12-08 21:26:19','1'),
  (0022,0012,0019,0009,5003,NULL,13338331.00,'2021-01-20 06:49:34','1'),
  (0023,0017,0012,0010,5001,NULL,6730485.00,'2020-09-14 21:11:39','1'),
  (0024,0016,0016,0013,5002,NULL,15468420.00,'2020-02-05 14:36:30','1'),
  (0025,0003,0011,0015,5001,'Обменяю халупу на дворец',7973212.00,'2020-12-31 05:05:37','1'),
  (0026,0010,0020,0016,5003,'0',3023735.00,'2020-09-26 20:39:57','1'),
  (0027,0005,0017,0012,5002,NULL,15490341.00,'2020-04-13 01:37:28','1'),
  (0028,0003,0015,0006,5003,NULL,18884271.00,'2020-06-12 21:05:36','1');

--
`show_property_meet`
--
- для заполнения этой таблицы существует процедура `shedule_show`

--
`contract`
--
- а для этой - процедура `add_contract`

