-- Выборка недвижимости, доступных для аренды. 
-- Подобным же образом можно смотреть собственность на продажу и обмен, изменяя индекс transaction_type: [5001, 5002, 5003]

SELECT `id`, (SELECT `property_type`.`type` FROM `property_type` WHERE `id` = `property`.`property_type_id`) 'Тип недвижимости',
		     `administrative_district_id` 'Административный округ',
             (SELECT `district`.`name` FROM `district` WHERE `id` = `property`.`district_id`) 'Район',
             (SELECT `type` FROM `transaction_type` WHERE `id` = `property`.`transaction_id`) 'Тип сделки',
             (SELECT CONCAT_WS(' ', `surname`, `name`, `patronymic`) `t` FROM `client` WHERE `id` = `property`.`owner_client_id`) 'Полное имя собственника',
             `address` 'Адрес', `floor` 'Этаж', `rooms` 'Комнат', `square` 'Площадь', `bedrooms` 'Спален', `bathrooms` 'Санузлов',
             `details` 'Описание', `price` "Цена",
             IF(`is_new_building` = 1, 'Новостройка', '') AS ""             
FROM `property` WHERE `transaction_id` = 5003;
+------+-----------------------+------------------------+---------------------------+------------+---------------------------+---------------------------------------------+--------+---------+---------+---------+-----------+-----------+-------------+-------------+
| id   | Тип недвижимости      | Административный округ | Район                     | Тип сделки | Полное имя собственника   | Адрес                                       | Этаж   | Комнат  | Площадь | Спален  | Санузлов  | Описание  | Цена        |             |
+------+-----------------------+------------------------+---------------------------+------------+---------------------------+---------------------------------------------+--------+---------+---------+---------+-----------+-----------+-------------+-------------+
| 0002 | Торговая площадь      | СВАО                   | Крюково                   | Аренда     | Власова София Тимофеевна  | 129090, Москва, ул.Мещанская, 77, кв.29     |      6 |       6 | 240.5   |       1 |         1 | В квартир |  1004905.00 |             |
| 0005 | Свободного назначения | ЗелАО                  | Можайский                 | Аренда     | Соловьев Тихон Ярославович| 109472, Москва, ул.Садоводства, 91, кв.21   |      9 |       7 | 200.5   |       3 |         2 | Квартира  | 13198169.00 | Новостройка |
| 0008 | Комната               | ЮВАО                   | Новогиреево               | Аренда     | Сабуни Халед              | 107553, Москва, ул.Штатная Горка, 50, кв.60 |     15 |       6 | 52.8    |       3 |         1 | В стоимос |  3094885.00 | Новостройка |
| 0013 | Участок               | ВАО                    | Зябликово                 | Аренда     | Кира Демьянова Сергеевна  | 119619, Москва, ул.4-я Новые Сады, 96, кв.37|     27 |       3 | 165.6   |       1 |         1 | Продается | 10783256.00 | Новостройка |
| 0014 | Таунхаус              | ЗАО                    | Бабушкинский              | Аренда     | Алексеев Иван Львович     | 109382, Москва, ул.Егорьевская, 43, кв.97   |     20 |       3 | 42.4    |       2 |         2 | До метро  | 18133517.00 |             |
| 0016 | Свободного назначения | ЗАО                    | Северное Орехово-Борисово | Аренда     | Сабуни Халед              | 119634, Москва, ул.Лукинская, 73, кв.26     |     10 |       2 | 203.1   |       1 |         1 | Поблизост | 19254308.00 | Новостройка |
| 0017 | Торговая площадь      | ЦАО                    | Тимирязевский             | Аренда     | Владимирова Ева Николаевна| 103031, Москва, ул.Пушечная, 6, кв.72       |     23 |       2 | 174.9   |       1 |         1 |  В пешей  |  4935805.00 | Новостройка |
+------+-----------------------+------------------------+---------------------------+------------+---------------------------+---------------------------------------------+--------+---------+---------+---------+-----------+-----------+-------------+-------------+

-- Запрос на заработок риелторского агентства за текущий год
SELECT SUM(ROUND(price * (fee_percentage / 100), 2)) 
	FROM contract INNER JOIN property ON contract.property_id = property.id
	WHERE YEAR(contract.`date`) = YEAR(NOW());
+------------------------------------+
| Прибыль за текущий год             |
+------------------------------------+
|                         2910037.14 |
+------------------------------------+

-- Небольшой вложенный запрос на среднюю цену на недвижимость каждого типа					   
SELECT `property_type`.`type` 'Тип недвижимости', 
	(SELECT COUNT(*) FROM property WHERE property.property_type_id = property_type.id) `Количество активных`,
        (SELECT AVG(price) FROM property WHERE property.property_type_id = property_type.id) `Средняя цена`
FROM property_type ORDER BY `Количество активных` DESC;
+--------------------------+------------------------+-------------------------+
| Тип недвижимости         | Количество активных    | Средняя цена            |
+--------------------------+------------------------+-------------------------+
| Таунхаус                 |                      3 |         15600062.333333 |
| Торговая площадь         |                      3 |          3487247.666667 |
| Свободного назначения    |                      3 |         16643623.000000 |
| Производство             |                      3 |          7473938.333333 |
| Часть дома               |                      2 |          5223243.500000 |
| Квартира                 |                      1 |         11802236.000000 |
| Комната                  |                      1 |          3094885.000000 |
| Доля                     |                      1 |         10714055.000000 |
| Участок                  |                      1 |         10783256.000000 |
| Офис                     |                      1 |         10292995.000000 |
| Склад                    |                      1 |         14860427.000000 |
| Дом                      |                      0 |                    NULL |
| Здание                   |                      0 |                    NULL |
| Гараж                    |                      0 |                    NULL |
+--------------------------+------------------------+-------------------------+
					   
					
