-- Представление property_owner_info включает в себя общую информацию о недвижимости(район, адрес, тип, операция, цена) и контакты собственника(мобильный телефон). 

CREATE OR REPLACE VIEW `property_owner_info` AS
	SELECT `d`.`name`, `p`.`address`, `pt`.`type` `property_type`, `tp`.`type` `transaction_type`,`p`.`price`, 
			CONCAT_WS(' ', `c`.`surname`, `c`.`name`, `c`.`patronymic`) `full_name`, `ct`.`type` `client_type`,
			concat('+', `c`.`phone`) `phone` FROM `district` `d` 
	LEFT JOIN
		`property` `p` ON `d`.`id` = `p`.`district_id` 
	LEFT JOIN 
		`client` `c` ON `c`.`id` = `p`.`owner_client_id`
	LEFT JOIN
		`client_type` `ct` ON `c`.`client_type_id` = `ct`.`id`
	LEFT JOIN
		`property_type` `pt` ON `p`.`property_type_id` = `pt`.`id`
	LEFT JOIN 
		`transaction_type` `tp` ON `p`.`transaction_id` = `tp`.`id`
	WHERE `p`.`address` IS NOT NULL;
  
-- example
>> SELECT * FROM `property_owner_info`;
+-----------------------+--------------------------------------------------+--------------------------+------------------+-------------+----------------------------------+--------------+--------------+
| name                  | address                                          | property_type            | transaction_type | price       | full_name                        | client_type  | phone        |
+-----------------------+--------------------------------------------------+--------------------------+------------------+-------------+----------------------------------+--------------+--------------+
| Михайлово-Ярцеское    | 109029, Москва, ул.Воловья, 87, кв.92            | Таунхаус                 | Обмен            | 11137105.00 | Королёва Ульяна Константиновна   | Клиент       | +77715490892 |
| Крюково               | 129090, Москва, ул.Мещанская, 77, кв.29          | Торговая площадь         | Аренда           |  1004905.00 | Власова София Тимофеевна         | Клиент       | +77932764676 |
| Головинский           | 129345, Москва, ул.Оборонная, 40, кв.88          | Торговая площадь         | Купля-продажа    |  4521033.00 | Поликарпова Елизавета Романовна  | Агент        | +78486566991 |
| Тёплый Стан           | 109202, Москва, ул.1-я Карачаровская, 69, кв.52  | Квартира                 | Купля-продажа    | 11802236.00 | Зотова Юлия Владимировна         | Агент        | +78033227548 |
| Можайский             | 109472, Москва, ул.Садоводства, 91, кв.21        | Свободного назначения    | Аренда           | 13198169.00 | Соловьев Тихон Ярославович       | Клиент       | +78772131582 |
| Свиблово              | 121374, Москва, ул.Сафоновская, 66, кв.29        | Склад                    | Купля-продажа    | 14860427.00 | Королёва Ульяна Константиновна   | Клиент       | +77715490892 |
| Западное Бирюлёво     | 125239, Москва, ул.Коптевская, 20, кв.30         | Таунхаус                 | Обмен            | 17529565.00 | Рыбаков Кирилл Маркович          | Агент        | +78257005070 |
| ...                   | ...                                              | ...                      | ...              | ...         | ...                              | ...          | ...          |
+-----------------------+--------------------------------------------------+--------------------------+------------------+-------------+----------------------------------+--------------+--------------+

-- Представление информации всех сделок в соответствии с таблицей показов. Проще говоря, учёт показов, которые привели к успешной сделке и самих сделок.
-- Также можно узнать, сколько дней понадобилось на решение заключения контракта с даты просмотра

CREATE OR REPLACE VIEW `show_then_contract` AS
SELECT `spm`.`property_id`, `d`.`name` ,`p`.`address`, `r`.`full_name` `realtor`, `spm`.`date` `show_date`, 
(SELECT CONCAT(`surname`, ' ' , `name`) FROM client WHERE id = SPLIT_STRING(`c`.`counteragents`, ', ', 1)) `counteragent_1`,
(SELECT CONCAT(`surname`, ' ' , `name`) FROM client WHERE id = SPLIT_STRING(`c`.`counteragents`, ', ', 2)) `counteragent_2`,
 `t`.`type`, `c`.`payment_sum`, 
`c`.`payment_sum` * ((100 - `c`.`fee_percentage`)/100) `fee`,
 c.`date` `contract_date`, CONCAT(datediff( `c`.`date`, `spm`.`date`), ' д.') `date_difference`
FROM `show_property_meet` `spm` 
LEFT JOIN
`contract` `c` ON  `spm`.`property_id` = `c`.`property_id`
LEFT JOIN `property` `p` ON `p`.`id` = `c`.`property_id`
LEFT JOIN `realtor` `r` ON `spm`.`realtor_id` = `r`.`id`
LEFT JOIN `transaction_type` t ON p.transaction_id = t.id
LEFT JOIN `district` d ON p.district_id = d.id
WHERE `spm`.`property_id` IN (SELECT `property_id` FROM `contract`);

-- example
>> SELECT * FROM `show_then_contract`;								    
+-------------+---------------+---------------------------------------------+------------------------------+---------------------+------------------+-----------------+--------------+-------------+-----------------+---------------------+-----------------+
| property_id | name          | address                                     | realtor                      | show_date           | counteragent_1   | counteragent_2  | type         | payment_sum | fee             | contract_date       | date_difference |
+-------------+---------------+---------------------------------------------+------------------------------+---------------------+------------------+-----------------+--------------+-------------+-----------------+---------------------+-----------------+
|        0014 | Бабушкинский  | 109382, Москва, ул.Егорьевская, 43, кв.97   | Беляева Мирослава Кирилловна | 2021-01-08 11:59:15 | Анна Егорова     | Власова София   | Аренда       | 16320165.30 | 14688148.770000 | 2021-01-24 18:15:48 | 16 д.           |
| ...         | ...           | ...                                         | ...                          | ...                 | ...              | ...             | ...          | ...         | ...             | ...                 | ...             |
+-------------+---------------+---------------------------------------------+------------------------------+---------------------+------------------+-----------------+--------------+-------------+-----------------+---------------------+-----------------+
									    
									    
