-- Представление property_owner_info включает в себя общую информацию о недвижимости(район, адрес, цена) и контакты собственника(мобильный телефон). 

CREATE OR REPLACE VIEW `property_owner_info` AS
	SELECT `d`.`name`, `p`.`address`, `pt`.`type` `property_type`, `p`.`price`, 
			CONCAT_WS(' ', `c`.`surname`, `c`.`name`, `c`.`patronymic`) `full_name`, `ct`.`type` `client_type`,
			concat('+', `c`.`phone`) `phone` FROM `district` `d` 
	LEFT JOIN
		`property` `p` ON `d`.`id` = `p`.`district_id` 
	LEFT JOIN 
		`client` `c` ON `c`.`id` = `p`.`owner_client_id`
	LEFT JOIN
		`client_type` `ct` ON `c`.`client_type_id` = `ct`.`id`
	LEFT JOIN
		`property_type` `pt` ON `p`.`property_type_id` = `pt`.`id`
	WHERE `p`.`address` IS NOT NULL;
  
-- example
>> SELECT * FROM `property_owner_info`;
+--------------------------------------------------+----------------------------------------------------------------------------+-------------------------------------------+-------------+--------------------------------------------------------------+--------------+--------------+
| name                                             | address                                                                    | property_type                             | price       | full_name                                                    | client_type  | phone        |
+--------------------------------------------------+----------------------------------------------------------------------------+-------------------------------------------+-------------+--------------------------------------------------------------+--------------+--------------+
| Михайлово-Ярцеское                               | 109029, Москва, ул.Воловья, 87, кв.92                                      | Таунхаус                                  | 11137105.00 | Королёва Ульяна Константиновна                               | Клиент       | +77715490892 |
| Крюково                                          | 129090, Москва, ул.Мещанская, 77, кв.29                                    | Торговая площадь                          |  1004905.00 | Власова София Тимофеевна                                     | Клиент       | +77932764676 |
| Головинский                                      | 129345, Москва, ул.Оборонная, 40, кв.88                                    | Торговая площадь                          |  4521033.00 | Поликарпова Елизавета Романовна                              | Агент        | +78486566991 |
| Тёплый Стан                                      | 109202, Москва, ул.1-я Карачаровская, 69, кв.52                            | Квартира                                  | 11802236.00 | Зотова Юлия Владимировна                                     | Агент        | +78033227548 |
| Можайский                                        | 109472, Москва, ул.Садоводства, 91, кв.21                                  | Свободного назначения                     | 13198169.00 | Соловьев Тихон Ярославович                                   | Клиент       | +78772131582 |
| Свиблово                                         | 121374, Москва, ул.Сафоновская, 66, кв.29                                  | Склад                                     | 14860427.00 | Королёва Ульяна Константиновна                               | Клиент       | +77715490892 |
| Западное Бирюлёво                                | 125239, Москва, ул.Коптевская, 20, кв.30                                   | Таунхаус                                  | 17529565.00 | Рыбаков Кирилл Маркович                                      | Агент        | +78257005070 |
+--------------------------------------------------+----------------------------------------------------------------------------+-------------------------------------------+-------------+--------------------------------------------------------------+--------------+--------------+
                                                                                                                                          ...
